In [92]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [93]:
df = pd.read_csv('d1heights.csv')
df

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
9     imran    14.5
10     jose     6.1
11  deepika     5.6
12   yoseph     1.2
13    binod     5.5

In [94]:
df.describe()

          height
count  14.000000
mean    6.050000
std     2.779804
min     1.200000
25%     5.250000
50%     5.550000
75%     6.175000
max    14.500000

there shows height = 1.2 and 14.5 . which is't possible.

In [95]:
df['height']

0      5.9
1      5.2
2      5.1
3      5.5
4      4.9
5      5.4
6      6.2
7      6.5
8      7.1
9     14.5
10     6.1
11     5.6
12     1.2
13     5.5
Name: height, dtype: float64

detect outliers

In [96]:
max_thresold = df['height'].quantile(0.95)
max_thresold

9.689999999999998

In [97]:
def new_func():
    return df[df['height']>max_thresold]

new_func()

    name  height
9  imran    14.5

In [98]:
min_thresold = df['height'].quantile(0.05)
min_thresold

3.6050000000000004

In [99]:
df[df['height']<min_thresold]

      name  height
12  yoseph     1.2

remove outliers

In [100]:
df[ (df['height']<max_thresold) & (df['height']>min_thresold)]

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

example big data set

In [101]:
df = pd.read_csv('d1bhp.csv')
df

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250
...,...,...,...,...,...,...,...
13195,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689
13196,other,4 BHK,3600.0,5.0,400.00,4,11111
13197,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258
13198,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407
13199,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090

In [102]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [103]:
df.shape

(13200, 7)

In [104]:
df.max()

location              other
size              9 Bedroom
total_sqft          52272.0
bath                   40.0
price                3600.0
bhk                      43
price_per_sqft     12000000
dtype: object

In [105]:
df.min()

location          1st Block Jayanagar
size                            1 BHK
total_sqft                        1.0
bath                              1.0
price                             8.0
bhk                                 1
price_per_sqft                    267
dtype: object

In [106]:
max_threshold_pr = df['price'].quantile(0.95)
max_threshold_pr

320.0

In [107]:
min_threshold_pr = df['price'].quantile(0.01)
min_threshold_pr

19.0

In [108]:
new_df = df[(df['price']<max_threshold_pr) & (df['price']>min_threshold_pr)]
new_df

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250
...,...,...,...,...,...,...,...
13192,Bellandur,2 BHK,1262.0,2.0,47.00,2,3724
13193,Uttarahalli,3 BHK,1345.0,2.0,57.00,3,4237
13194,Green Glen Layout,3 BHK,1715.0,3.0,112.00,3,6530
13195,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689
13197,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258

In [109]:
df['size'].max()

'9 Bedroom'

In [110]:
df['total_sqft'].max()

52272.0

In [111]:
max_threshold_sq= df['total_sqft'].quantile(0.95)
max_threshold_sq

3216.549999999992

In [112]:
min_threshold_sq = df['total_sqft'].quantile(0.05)
min_threshold_sq

671.95

In [113]:
new_df = df[(df['total_sqft']<max_threshold_pr) & (df['total_sqft']>min_threshold_pr)]
new_df

,location,size,total_sqft,bath,price,bhk,price_per_sqft
117,Hennur Road,2 Bedroom,276.0,3.0,23.00,2,8333
978,Rajaji Nagar,4 Bedroom,315.0,4.0,90.00,4,28571
1106,other,5 Bedroom,24.0,2.0,150.00,5,625000
2457,Bhoganhalli,1 RK,296.0,1.0,22.89,1,7733
4806,Nagarbhavi,1 BHK,300.0,1.0,20.00,1,6666
5911,Mysore Road,1 Bedroom,45.0,1.0,23.00,1,51111
10422,Yelahanka New Town,1 BHK,284.0,1.0,8.00,1,2816
11385,Malleshwaram,2 BHK,302.0,2.0,25.00,2,8278
11447,Whitefield,4 Bedroom,60.0,4.0,218.00,4,363333
13097,other,1 BHK,250.0,2.0,40.00,1,16000

In [115]:
new_df.shape

(10, 7)